app/views/users/show.html.erb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 1 ORDER BY microposts.created_at DESC
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1
---

	<% unless @user.microposts.empty? %>