app/controllers/microposts_controller.rb

  def create
    @micropost  = current_user.microposts.build(params[:micropost])
    if @micropost.save
      flash[:success] = "Your Juitt was succesfully posted!"
      redirect_to root_path
    else
      flash[:error] = "Error trying to fetch data from link, please try another one!"
      @feed_items = current_user.feed.paginate(:page => params[:page])
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "hello"], ["created_at", Mon, 06 Feb 2012 12:56:36 UTC +00:00], ["updated_at", Mon, 06 Feb 2012 12:56:36 UTC +00:00], ["user_id", 1]]
SELECT "microposts".* FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT COUNT(*) FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships