app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 103 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 1
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])

INSERT INTO `users` (`admin`, `created_at`, `email`, `encrypted_password`, `name`, `salt`, `updated_at`) VALUES (0, '2012-08-09 10:23:40', 'daweisz@gmail.com', '1b4a45dbc13441dc2e59ed66dec76f81160be9aa7ffbd8c1eb838680afc30aca', 'David', '8cec992f71bcf06e1f6983901fc8dd5b91c7ba86a13e4d47b36b4f131c7d27cc', '2012-08-09 10:23:40')
---
  def create
    @user = User.new(params[:user])
    if @user.save